 const cheerio = require('cheerio');
 const request = require('request');

 const url = 'https://ncov2019.live/';

 const countries_ar = [
     "الاجمالى",
     "الولايات المتحدة الأمريكية",
     "إسبانيا",
     "إيطاليا",
     "فرنسا",
     "ألمانيا",
     "الصين",
     "المملكة المتحدة",
     "إيران",
     "تركيا",
     "بلجيكا",
     "هولندا",
     "سويسرا",
     "كندا",
     "البرازيل",
     "روسيا",
     "البرتغال",
     "النمسا",
     "إسرائيل",
     "السويد",
     "أيرلندا",
     "كوريا الجنوبية",
     "الهند",
     "اليابان",
     "إكوادور",
     "تشيلي",
     "بيرو",
     "بولندا",
     "رومانيا",
     "النرويج",
     "أستراليا",
     "الدنمارك",
     "التشيك",
     "باكستان",
     "السعودية",
     "الفلبين",
     "ماليزيا",
     "المكسيك",
     "إندونيسيا",
     "الإمارات العربية المتحدة",
     "صربيا",
     "بنما",
     "لوكسمبورغ",
     "قطر",
     "أوكرانيا",
     "فنلندا",
     "جمهورية الدومينيكان",
     "بيلاروس",
     "سنغافورة",
     "كولومبيا",
     "تايلاند",
     "الأرجنتين",
     "جنوب إفريقيا",
     "اليونان",
     "مصر",
     "الجزائر",
     "المغرب",
     "آيسلندا",
     "مولدوفا",
     "كرواتيا",
     "المجر",
     "العراق",
     "البحرين",
     "نيوزيلندا",
     "إستونيا",
     "الكويت",
     "سلوفينيا",
     "أذربيجان",
     "ليتوانيا",
     "أرمينيا",
     "هونغ كونغ",
     "البوسنة",
     "كازاخستان",
     "أوزبكستان",
     "شمال مقدونيا",
     "الكاميرون",
     "بنغلاديش",
     "سلوفاكيا",
     "عمان",
     "كوبا",
     "الأميرة الماسية",
     "تونس",
     "بلغاريا",
     "أفغانستان",
     "لاتفيا",
     "أندورا",
     "قبرص",
     "لبنان",
     "كوستاريكا",
     "ساحل العاج",
     "غانا",
     "النيجر",
     "بوركينا فاسو",
     "أوروغواي",
     "ألبانيا",
     "هندوراس",
     "تايوان",
     "الأردن",
     "مالطا",
     "جمهورية قيرغيز",
     "سان مارينو",
     "بوليفيا",
     "نيجيريا",
     "موريشيوس",
     "السنغال",
     "كوسوفو",
     "الجبل الأسود",
     "فلسطين",
     "جورجيا",
     "فيتنام",
     "غينيا",
     "جزيرة مان",
     "جمهورية الكونغو الديمقراطية",
     "غيرنسي",
     "سريلانكا",
     "جيرسي",
     "كينيا",
     "جيبوتي",
     "فنزويلا",
     "غواتيمالا",
     "باراغواي",
     "السلفادور",
     "بروناي",
     "جبل طارق",
     "رواندا",
     "كمبوديا",
     "ترينيداد وتوباغو",
     "مالي",
     "مدغشقر",
     "شمال قبرص",
     "موناكو",
     "أروبا",
     "ليختنشتاين",
     "توغو",
     "إثيوبيا",
     "جامايكا",
     "بربادوس",
     "جمهورية الكونغو",
     "الصومال",
     "أوغندا",
     "بولينيزيا الفرنسية",
     "سينت مارتن",
     "الغابون",
     "ليبيريا",
     "برمودا",
     "جزر البهاما",
     "جزر كايمان",
     "ماكاو",
     "غيانا",
     "زامبيا",
     "غينيا - بيساو",
     "ميانمار",
     "بنين",
     "إريتريا",
     "جمهورية تنزانيا المتحدة",
     "هايتي",
     "سوريا",
     "ليبيا",
     "أنتيغوا وبربودا",
     "موزمبيق",
     "أنغولا",
     "جزر المالديف",
     "كاليدونيا الجديدة",
     "لاوس",
     "غينيا الاستوائية",
     "ناميبيا",
     "فيجي",
     "منغوليا",
     "سانت لوسيا",
     "السودان",
     "كوراساو",
     "غرينادا",
     "Eswatini",
     "زيمبابوي",
     "بليز",
     "بوتسوانا",
     "مالاوي",
     "سانت فنسنت وجزر غرينادين",
     "كيتس ونيفيس",
     "غرينلاند",
     "المناطق المتنازع عليها",
     "سيشيل",
     "تشاد",
     "جمهورية أفريقيا الوسطى",
     "سورينام",
     "سيراليون",
     "غامبيا",
     "نيكاراغوا",
     "جزر تركس وكايكوس",
     "نيبال",
     "مونتسيرات",
     "الرأس الأخضر",
     "مدينة الفاتيكان",
     "موريتانيا",
     "سانت بارتيليمي",
     "بوتان",
     "جزر فوكلاند",
     "بوروندي",
     "جنوب السودان",
     "ساو تومي وبرينسيبي",
     "جزر فيرجن البريطانية",
     "أنغيلا",
     "بابوا غينيا الجديدة",
     "تيمور - ليشتي",
     "اليمن"
 ];
 exports.getCOVIDStats = (req, res, next) => {
     console.log('getCOVIDStats called ...');

     request(url, (error, response, html) => {

         if (!error && response.statusCode == 200) {
             const $ = cheerio.load(html);
             const statsTable = $('.tables').find('table').children().eq(5).find('tr');
             const COVIDStats = [];

             statsTable.each((i, el) => {
                 //  const item = $(el).text().replace(/\s\s+/g, ' ');
                 //  console.log(item, '\n......../n');
                 const name = $(el).children().eq(0).text().replace(/\s\s+/g, '').replace('★', '');
                 const name_ar = name;
                 const confirmed = $(el).children().eq(1).text().replace(/\s\s+/g, '');
                 const confirmedChangesToday = $(el).children().eq(2).text().replace(/\s\s+/g, '');
                 const confirmedPercentage = $(el).children().eq(3).text().replace(/\s\s+/g, '');
                 const critical = $(el).children().eq(4).text().replace(/\s\s+/g, '');
                 const deceased = $(el).children().eq(5).text().replace(/\s\s+/g, '');
                 const deceasedChangesToday = $(el).children().eq(6).text().replace(/\s\s+/g, '');
                 const deceasedPercentage = $(el).children().eq(7).text().replace(/\s\s+/g, '');
                 const recovered = $(el).children().eq(8).text().replace(/\s\s+/g, '');
                 const active = $(el).children().eq(9).text().replace(/\s\s+/g, '');


                 COVIDStats.push({
                     name,
                     name_ar,
                     confirmed,
                     confirmedChangesToday: confirmedChangesToday + ' (' + confirmedPercentage + ')',
                     critical,
                     deceased,
                     deceasedChangesToday: deceasedChangesToday + ' (' + deceasedPercentage + ')',
                     recovered,
                     active
                 });
             });

             //  console.log(COVIDStats);

             res.status(200).json({
                 COVIDStats: COVIDStats
             });
         } else {
             console.log(error);
             console.log('getCOVIDStats error.... ');
             res.status(500).json({
                 message: error
             });
         }

     })


 }